mod-4-proj-music-api/app/controllers/api/v1/playlists_controller.rb

  def index
    @playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"

  def create
    # byebug
    # see if this track exists in the db
    track = Track.find_by(spotify_id: params[:spotify_id])
    unless track
      # find the spotify song from the api
      s_track = RSpotify::Track.find(params[:spotify_id])
      # create a new track
      track = Track.create_from_spotify_track(s_track)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."spotify_id" = $1 LIMIT $2  [["spotify_id", "10M2Ex445zw585Ducldzkw"], ["LIMIT", 1]]
INSERT INTO "tracks" ("name", "artists", "image", "duration", "popularity", "spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"