mod-4-proj-music-api/app/controllers/api/v1/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    s_tracks = RSpotify::Track.search(params[:q])

    @tracks = s_tracks.map do |s_track|