mod-4-proj-music-api/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["username", "test"], ["password_digest", "test"], ["created_at", "2019-01-20 20:47:04.083224"], ["updated_at", "2019-01-20 20:47:04.083224"]]
---
  def create
    @user = User.create(user_params)

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "party"], ["updated_at", "2019-01-22 19:32:07.717313"], ["id", 2]]
---
  def update
    @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    @users = User.all
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_user
    @user = User.find(params[:id])